# drop_duplicates

데이터프레임에서 중복되는 행을 제거하고 고유한 값만 남기고 싶을 때 Pandas의 drop_duplicates를 활용하면 된다.

In [1]:
import pandas as pd

예시 데이터

In [2]:
df = pd.DataFrame({'Num':[1, 2, 1, 2, 2, 3], 
                   'Alphabet':['a', 'b', 'a', 'b', 'a', 'b']})
df

   Num Alphabet
0    1        a
1    2        b
2    1        a
3    2        b
4    2        a
5    3        b

### 1. 중복제거

In [3]:
df.drop_duplicates()

   Num Alphabet
0    1        a
1    2        b
4    2        a
5    3        b

### 2. 열 지정하여 중복제거

In [4]:
df.drop_duplicates(['Num'])

   Num Alphabet
0    1        a
1    2        b
5    3        b

In [5]:
# 여러개
df.drop_duplicates(['Num', 'Alphabet'])

   Num Alphabet
0    1        a
1    2        b
4    2        a
5    3        b

### 3. 남길 대상 지정

첫번째 데이터만 남기기

In [6]:
df.drop_duplicates(['Num'], keep = 'first')

   Num Alphabet
0    1        a
1    2        b
5    3        b

마지막에 오는 데이터 남기기

In [7]:
df.drop_duplicates(['Num'], keep = 'last')

   Num Alphabet
2    1        a
4    2        a
5    3        b

중복 데이터 모두 삭제

In [8]:
df.drop_duplicates(['Num'], keep = False)

   Num Alphabet
5    3        b

### 4. 인덱스 재설정

결과의 인덱스를 재정렬

In [9]:
df.drop_duplicates(['Num'], ignore_index = True)

   Num Alphabet
0    1        a
1    2        b
2    3        b